Repository: 84000/data-translation-memory
Catalog: toh116-v1.tmx
Source language: bo
Languages: en

source: གང་གི་ཚེ་དེ་དག་གིས་སིལ་སྙན་དཀྲོལ་བ་དེའི་ཚེ་རི་དགས་དང་། བྱ་དག་ཀྱང་སེམས་ཅན་འདི་དག་ནི་སྡུག་བསྔལ་ཏེ། འཛམ་བུའི་གླིང་ན་ཇི་ལྟ་བུའི་སྡུག་བསྔལ་དག་མྱོང་བར་གྱུར། །
en: When they play music, deer, birds, and so on contemplate deeply. They see the suffering and happiness of beings in saṃsāra and the way in which suffering is experienced in Jambudvīpa.

source: སྐྱེ་བ་དང་། རྒ་བ་དང་། འཆི་བ་དག་ཀྱང་མཐོང་ངོ་། །
en: They see birth, aging, and death.

source: སྡུག་ཅིང་མཛའ་བ་དང་། མི་མཛའ་བ་ལས་འདུ་བ་དང་བྲལ་བར་ཡང་མཐོང་ངོ་། །
en: They see separation from the desired and beloved, and encounters with the disliked.

source: མི་དག་ཀྱང་སྡུག་བསྔལ་མང་དུ་མྱོང་ངོ་ཞེས་སྐྱོ་བར་བྱེད་དོ།
en: They see human beings undergoing many kinds of suffering.

source: དེ་ལྟར་རི་དགས་དང་། བྱ་དག་སྟོང་པའི་རྗེས་སུ་བསམས་པ་དང་།
en: The deer and birds contemplate deeply in that way.

source: དེའི་ཚེ་ཐེག་པ་ཆེན་པོའི་མདོ་དཀོན་མཆོག་གི་རྒྱལ་པོ་ཟ་མ་ཏོག་བཀོད་པ་འདི་རྗེས་སུ་དྲན་ནས་དེ་དག་ལ་ལྷའི་རོའི་རོ་མཆོག་གི་ཟས་དག་ཀྱང་འབྱུང་བར་འགྱུར།
en: When they remember the name the precious king of the Mahāyāna sūtras, The Sūtra of the Basket’s Display , food with supreme divine flavors appears,

source: ལྷའི་རྫས་དྲི་ཞིམ་པོ་དག་ཀྱང་འབྱུང་བར་འགྱུར།
en: divine aromatic substances appear,

source: ལྷའི་གོས་དག་ཀྱང་འབྱུང་བར་འགྱུར་རོ།
en: and divine clothing appears.

source: གང་གི་ཚེ་ན་དེ་དག་བསམ་པ་སེམས་པ་དེའི་ཚེ་བསམ་པ་གྲུབ་པར་འགྱུར་རོ།
en: Whenever they wish for something, their wishes are fulfilled.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Bodhisattva Sarva­nīvaraṇa­viṣkambhin said to the Bhagavat,

source: བཅོམ་ལྡན་འདས་བདག་ནི་ཤིན་ཏུ་ངོ་མཚར་རྨད་དུ་གྱུར་པ་ཐོབ་བོ། །
en: “Bhagavat, I am utterly astonished.”

source: རིགས་ཀྱི་བུ་ཅིའི་ཕྱིར་ངོ་མཚར་བར་གྱུར། །
en: “Noble son, why are you astonished?”

source: བཅོམ་ལྡན་འདས་གང་གི་ཚེ་ཐེག་པ་ཆེན་པོའི་མདོ་དཀོན་མཆོག་གི་རྒྱལ་པོ་ཟ་མ་ཏོག་བཀོད་པའི་མིང་གི་རྗེས་སུ་དྲན་ན། དེའི་མིང་ཙམ་གྱིས་ཀྱང་འདི་འདྲ་བའི་རྫས་དག་འབྱུང་བར་འགྱུར་ན་
en: “Bhagavat, if those kinds of things appear just because someone thinks of the name of the precious king of the Mahāyāna sūtras, The Sūtra of the Basket’s Display

source: གང་ཐེག་པ་ཆེན་པོའི་མདོ་དཀོན་མཆོག་གི་རྒྱལ་པོ་ཟ་མ་ཏོག་བཀོད་པ་ཉན་པ་དང་། འཛིན་པ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་པའི་སེམས་ཅན་དེ་དག་ནི་བདེ་བ་དང་ལྡན་པ་ལགས་སོ། །
en: then those who listen to, cause to be written out, possess, recite, study, and have their minds completely focused on the precious king of the Mahāyāna sūtras, The Sūtra of the Basket’s Display , will have happiness.

source: གང་ཐེག་པ་ཆེན་པོའི་མདོ་ཟ་མ་ཏོག་བཀོད་པ་ལས་ཡི་གེ་གཅིག་ཀྱང་འདྲིར་འཇུག་པའི་སེམས་ཅན་དེ་དག་ནི་བདེ་བ་དང་ལྡན་པ་ལགས་ཏེ།
en: “Those who write a single letter from the precious king of the Mahāyāna sūtras, The Sūtra of the Basket’s Display , will have happiness and

source: དེ་དག་ནི་འཁོར་བའི་སྡུག་བསྔལ་འདི་དག་མཐོང་བར་མི་འགྱུར་རོ། །
en: will not see these sufferings of saṃsāra.

source: དེ་དག་ནི་ཕྱག་དར་པ་དང་། སྨེ་ཤ་ཅན་གྱི་རིགས་སུ་མི་སྐྱེ།
en: They will not be reborn as an untouchable or of mixed caste;

source: དབང་པོ་ཉམས་པར་མི་འགྱུར། ཐེང་པོ་དང་། སྒུར་པོ་དང་། གུག་པ་དང་། པུས་མོའི་ནང་འཐབ་པ་དང་། ལུས་པོ་ཆེ་དང་། མཛེ་ཅན་དུ་མི་འགྱུར།
en: they will not be reborn as someone with defective senses; they will not be reborn as lame, hunchbacked, with a deformed nose, a goiter, or a cleft lip, nor with leprosy.

source: དེ་དག་གི་ལུས་ལ་ནད་དག་གིས་བཏབ་པར་མི་འགྱུར་ཏེ།
en: Their bodies will not be afflicted by illness.

source: ནད་མེད་པ་དང་། མཐུ་ཆེ་བ་དང་། དབང་པོ་གསལ་བར་འགྱུར་རོ། །
en: They will have health, great strength, and clear faculties.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ནས་
en: The Bhagavat gave his approval, saying, “That is excellent,

source: སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་ཁྱོད་འདི་འདྲ་བའི་སྤོབས་པ་དང་། ལྷ་དང་ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་། མི་མ་ཡིན་པ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་འདུས་པ་ལ་ཁྱོད་ཀྱིས་འདི་འདྲ་བའི་ཆོས་ཀྱི་གཏམ་རྒྱ་ཆེན་པོ་བྱས་པ་ལེགས་སོ་ལེགས་སོ། །
en: Sarva­nīvaraṇa­viṣkambhin. Your eloquence and your teaching of this kind of Dharma to a gathering of devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, humans, nonhumans, upāsakas, and upāsikās is excellent! Excellent!

source: བཅོམ་ལྡན་འདས་གང་གི་ཚེ་ན་བདག་གི་ཞུ་བ་འདི་བསྟན་པ་དེའི་ཚེ་ལྷའི་བུ་རྣམས་མི་ཕྱེད་པའི་དད་པ་སྐྱེས་པར་གྱུར་ཏོ།
en: “Bhagavat, when you teach what I request, the devas gain unwavering faith.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: The Bhagavat gave his approval, saying, “Excellent,

source: རིགས་ཀྱི་བུ་ཁྱོད་ཕྱི་ཕྱིར་ཞིང་གསོལ་བ་ལེགས་སོ་ལེགས་སོ་
en: noble son. That you repeatedly make these requests is excellent, excellent.

source: འདི་ལྟ་སྟེ། སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་བ་སྤུའི་ཁུང་བུ་ནག་པོ་འདས་ནས་བ་སྤུའི་ཁུང་བུ་རིན་པོ་ཆེའི་རྣ་ཆ་ཞེས་བྱ་བ་
en: “Sarva­nīvaraṇa­viṣkambhin, it is like this: Beyond the Kṛṣṇa pore there is a pore named Ratnakuṇḍala.

source: དེ་ན་དྲི་ཟའི་བུ་མོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དག་གནས་ཏེ།
en: Many trillions of female gandharvas live within it.

source: དྲི་ཟའི་བུ་མོ་དེ་དག་ཀྱང་བྱད་གཟུགས་བཟང་བ། །
en: Those female gandharvas have excellent figures;

source: མཛེས་པ། བལྟ་ན་སྡུག་པ།
en: are beautiful and attractive;

source: ཁ་དོག་ཤིན་ཏུ་བཟང་ཞིང་རྒྱས་པ་དང་ལྡན་པ།
en: have magnificent, fair complexions;

source: ལུས་ལྷའི་རྒྱན་གྱིས་བརྒྱན་པ།
en: their bodies are adorned with divine jewelry;

source: ལྷའི་བུ་མོ་འགྲན་པར་བྱེད་པ་དང་འདྲ་བ་
en: and they rival the apsarases.

source: དེ་ལྟ་བུར་ཤིན་ཏུ་བཟང་ཡང་འདོད་ཆགས་ཀྱི་སྡུག་བསྔལ་གྱིས་གཟིར་བར་མི་འགྱུར། །
en: Even though they have this beauty, they are not afflicted by the suffering of desire,

source: ཞེ་སྡང་གི་སྡུག་བསྔལ་གྱིས་གཟིར་བར་མི་འགྱུར།
en: they are not afflicted by the suffering of anger,

source: གཏི་མུག་གི་སྡུག་བསྔལ་གྱིས་གཟིར་བར་མི་འགྱུར།
en: and they are not afflicted by the suffering of stupidity.

source: དེ་དག་གི་ལུས་ལ་མིའི་སྡུག་བསྔལ་ཡང་མེད
en: Their bodies do not experience the sufferings that humans do.

source: དེ་དྲི་ཟའི་བུ་མོ་དེ་དག་དུས་གསུམ་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་མཚན་གྱི་རྗེས་སུ་དྲན་པར་བྱེད་དེ། དེའི་ཚེ་རྫས་དེ་དག་ཐམས་ཅད་འབྱུང་ངོ་།
en: “Those gandharva maidens remember the name of Bodhisattva Mahāsattva Avalokiteśvara. Whenever in the three periods they remember it, all valuable things appear for them.”

source: བཅོམ་ལྡན་འདས་བདག་བ་སྤུའི་ཁུང་བུ་དེ་བལྟ་བར་འཚལ་གྱིས་བདག་དེར་མཆིའོ།
en: “Bhagavat, I will go to those pores because I want to see them.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། །
en: The Bhagavat said,

source: རིགས་ཀྱི་བུ་བ་སྤུའི་ཁུང་བུ་དེ་ནི་གཟུང་དུ་མི་རུང་སྟེ།
en: “Noble son, those pores cannot be perceived,

source: ཇི་ལྟར་ནམ་མཁའི་ཁམས་གཟུང་དུ་མི་རུང་།
en: just as the element of space cannot be perceived.

source: རེག་པར་མི་རུང་བ་དེ་བཞིན་དུ་རིགས་ཀྱི་བུ་བ་སྤུའི་ཁུང་བུ་དེ་ཡང་གཟུང་དུ་མི་རུང་། རེག་པར་མི་རུང་སྟེ། །
en: Noble son, those pores cannot be perceived, and they cannot be touched.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་དུ་བཟང་པོ་བ་སྤུའི་ཁུང་བུ་དེར་ལོ་བཅུ་གཉིས་སུ་ཀུན་དུ་སོང་ཡང་བ་སྤུའི་ཁུང་བུ་དེ་མ་མཐོང་སྟེ།
en: “Bodhisattva Mahāsattva Samantabhadra spent twelve years wandering in search of those pores, but he never saw them.

source: གང་བ་སྤུའི་ཁུང་བུ་རེ་རེ་ན་གནས་པ་དེས་ཀྱང་མ་མཐོང་ན་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པ་གཞན་དག་གིས་ལྟ་ཅི་སྨོས།
en: He did not even see the hundred buddhas who live in each of those pores, let alone any bodhisattvas.”

source: བཅོམ་ལྡན་འདས་གང་གི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་དུ་བཟང་པོས་ཀྱང་མ་མཐོང་ན་
en: “Bhagavat, if Bodhisattva Mahāsattva Samantabhadra did not see them

source: ཅི་བདག་མཆི་བར་བགྱི་འམ།
en: why should I go?”

source: གཟུགས་མེད་པ། གཟུགས་ཆེ་བ། ལག་པ་བརྒྱ་སྟོང་པ། མིག་བྱེ་བ་བརྒྱ་སྟོང་པ། མགོ་བཅུ་གཅིག་པ།
en: as being with form, a vast form, a hundred thousand arms, a trillion eyes, and eleven heads;

source: རྣལ་འབྱོར་ཆེན་པོ། རྣལ་འབྱོར་དམ་པ།
en: as being a great yogin, a sublime yogin;

source: མྱ་ངན་ལས་འདས་པའི་ས་ལ་གནས་པ། །
en: as residing on the level of nirvāṇa;

source: ཤེས་རབ་ཆེ་བ།
en: as having great wisdom;

source: སྲིད་པ་ལས་སྒྲོལ་བར་བྱེད་པ།
en: as liberated from existence;

source: རིགས་ཀྱི་དབང་པོ།
en: as being from the good family;

source: བལྟར་མི་སྣང་བ་སྟོན་པ་ལ་ཤེས་རབ་དང་ལྡན་པ་དང་།
en: as being imperceptible; and as being wise;

source: ཆོས་ཐམས་ཅད་ལ་གྲིབ་མར་གྱུར་པའོ།
en: and therefore he casts no shadow in the midst of all phenomena.

source: དེ་བཞིན་དུ་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ཡང་སུས་ཀྱང་མི་མཐོང་སྟེ།
en: “Thus, noble son, no one can see or hear Bodhisattva Mahāsattva Avalokiteśvara.

source: དེའི་རང་བཞིན་གྱི་ལུས་ནི་དེ་བཞིན་གཤེགས་པ་ཉིད་ཀྱིས་ཀྱང་མི་གཟིགས་ན་ཀུན་དུ་བཟང་པོ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་གཞན་གྱིས་ལྟ་ཅི་སྨོས། །
en: No tathāgata can see the body of his true nature, let alone Samantabhadra or other bodhisattvas.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་ནི་ཆོ་འཕྲུལ་བསམ་གྱིས་མི་ཁྱབ་པ་དག་སྟོན་ཏེ།
en: “Noble son, this bodhisattva mahāsattva is inconceivable. He manifests inconceivable miracles.

source: སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་དུ་མ་དག་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །
en: He has completely ripened many trillions of beings.

source: དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་ཀྱི་ལམ་ལ་འཇོག་གོ། །
en: He has led those beings onto the path to enlightenment.

source: བཞག་ནས་བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་འགྲོ་ཞིང་དེ་བཞིན་གཤེགས་པ་སྣང་བ་མཐའ་ཡས་པ་ལ་ཆོས་ཉན་ཏོ།
en: Having entered that path, they have gone to the realm of Sukhāvatī where they hear the Dharma from Tathāgata Amitābha.”

source: བཅོམ་ལྡན་འདས་ཐབས་གང་གིས་ན་བདག་གིས་མཐོང་བར་འགྱུར།
en: “Bhagavat, how can I see Bodhisattva Mahāsattva Avalokiteśvara?”

source: རིགས་ཀྱི་བུ་གལ་ཏེ་ང་ལ་བལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་། བསྙེན་བཀུར་བའི་ཕྱིར་མི་མཇེད་པའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཉིད་དུ་འོང་ནའོ། །
en: “Noble son, you will see him if he comes here, to the Sahā universe, to look at me, bow down to me, and honor me.”

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་མཆི་བར་གནང་བར་མཛོད་ཅིག
en: “I request it, Bhagavat, that Bodhisattva Mahāsattva Avalokiteśvara may come.”

source: རིགས་ཀྱི་བུ་གང་གི་ཚེ་ན་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་འགྱུར་བ་དེའི་ཚེ་ཐོག་མ་ཁོ་ནར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་འོང་ངོ་།
en: “Noble son, Bodhisattva Mahāsattva Avalokiteśvara first comes when a being is ripened.”

source: བདག་སྡིག་པ་དང་ལྡན་ཞིང་ཡུན་རིང་དུ་གསོན་ལ། སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་མཐོང་བ་དང་འབྲལ་ཞིང་ལོང་བར་གྱུར། ལམ་གསུམ་དུ་འགྲོ་བར་གྱུར་པ་ལྟ་ཅི་རུང་
en: “What point is there in my having a long life that is devoted to bad actions, deprived of the sight of Avalokiteśvara, blind, and following a path of darkness?”

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་གང་གི་ཚེ་ན་མཆི།
en: “Bhagavat, when is Bodhisattva Mahāsattva Avalokiteśvara coming?”

source: དེ་ནས་བཅོམ་ལྡན་འདས་བཞད་ནས་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་འོང་བའི་དུས་མ་ཡིན་ནོ།
en: The Bhagavat laughed and said, “Noble son, it is not yet time for Bodhisattva Mahāsattva Avalokiteśvara to come.

source: བ་སྤུའི་ཁུང་བུ་དེ་ནས་བབས་ནས་བདུད་རྩི་ཞེས་བྱ་བའི་བ་སྤུའི་ཁུང་བུ་དེ་ན་ལྷའི་བུ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་གནས་ཏེ།
en: Beyond that pore, there is a pore named Amṛtabindu. In that pore a million trillion devas live.

source: ཁ་ཅིག་ནི་ས་གཅིག་པ།
en: Some are on the first bhūmi;

source: ཁ་ཅིག་ནི་ས་གཉིས་པ།
en: some are on the second bhūmi;

source: ཁ་ཅིག་ནི་ས་གསུམ་པ།
en: some are on the third bhūmi;

source: ཁ་ཅིག་ནི་ས་བཞི་པ། །
en: some are on the fourth bhūmi;

source: ཁ་ཅིག་ནི་ས་ལྔ་པ། །
en: some are on the fifth bhūmi;

source: ཁ་ཅིག་ནི་ས་དྲུག་པ། །
en: some are on the sixth bhūmi;

source: ཁ་ཅིག་ནི་ས་བདུན་པ།
en: some are on the seventh bhūmi;

source: ཁ་ཅིག་ནི་ས་བརྒྱད་པ།
en: some are on the eighth bhūmi;

source: ཁ་ཅིག་ནི་ས་དགུ་པ།
en: some are on the ninth bhūmi;

source: ཁ་ཅིག་ནི་བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་པ་ཡིན་ནོ།
en: and some are on the tenth bodhisattva bhūmi.

source: བདུད་རྩིའི་ཐིགས་པའི་བ་སྤུའི་ཁུང་བུ་དེ་ན་གསེར་དང་དངུལ་གྱི་རི་དྲུག་ཅུ་ཡོད་དེ།
en: Within that pore named Amṛtabindu there are sixty mountains of gold and silver.

source: རི་རེ་རེ་ཞིང་ཡང་འཕང་དུ་དཔག་ཚད་དྲུག་ཁྲི་ཡོད་དོ།
en: Each one is sixty thousand yojanas high,

source: རི་རེ་རེ་ཞིང་ཡང་རྩེ་མོ་གསེར་གྱིས་བརྒྱན་པ་དགུ་ཁྲི་ཡོད་དོ།
en: and each one has ninety thousand peaks adorned by gold.

source: ངོས་ངོས་དག་ལ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དང་པོ་བསྐྱེད་པ་དག་གནས་སོ། །
en: Bodhisattvas who have developed one-pointed minds dwell on their slopes.

source: རིའི་རྒྱལ་པོ་དེ་དག་ལ་དྲི་ཟ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་གནས་ཏེ། །
en: On those kings of mountains, there dwell many millions of trillions of gandharvas,

source: རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་སིལ་སྙན་གྱི་སྒྲ་གྲག་པར་འཛིན་ཏོ།
en: who are continuously playing music.

source: བདུད་རྩིའི་ཐིགས་པའི་བ་སྤུའི་ཁུང་བུ་དེ་ན་གཞལ་མེད་ཁང་བརྒྱ་སྟོང་ཕྲག་དུ་མ་ལྷའི་ནོར་བུ་དང་མུ་ཏིག་གིས་ཡོངས་སུ་བརྒྱན་པ། །
en: Within that pore named Amṛtabindu there are many millions of trillions of extremely beautiful celestial palaces completely adorned with divine jewels,

source: ཤིན་ཏུ་མཛེས་པ་བལྟ་ན་སྡུག་པ་རྣམ་པ་སྣ་ཚོགས་པ། །
en: having many kinds of visual delights,

source: མུ་ཏིག་གི་སེ་མོ་དོ་བརྒྱ་སྟོང་གིས་བརྒྱན་པ་དག་ཡོད་དེ།
en: and adorned by a hundred thousand strings of pearls.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གཞལ་མེད་ཁང་དེར་ངལ་བསོས་ནས་ཆོས་ཀྱི་གཏམ་བྱེད་དོ།
en: “Bodhisattvas relax in those celestial palaces and discuss the Dharma.

source: དེ་ནས་གཞལ་མེད་ཁང་ནས་བྱུང་ནས་བདག་བདག་གི་འཆག་སར་འགྲོ་སྟེ།
en: Then they leave the celestial palaces and go each to their own walkways,

source: འཆག་ས་རེ་རེ་ཞིང་ཡང་རྫིང་བུ་བདུན་ཅུ་བདུན་ཅུ་ཡོད་པ། །
en: each of which has seventy bathing pools.

source: ལ་ལ་ནི་ཆུ་ཡན་ལག་བརྒྱད་དང་ལྡན་པས་ཡོངས་སུ་གང་ངོ་།
en: Some are filled with water that has the eight qualities,

source: ལ་ལ་ནི་མེ་ཏོག་གིས་ཡོངས་སུ་གང་སྟེ། མེ་ཏོག་ཨུད་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པུན་ད་རཱི་ཀ་དང་། དྲི་ཞིམ་པ་དང་། མན་དཱ་ར་བ་དང་། མན་དཱ་ར་བ་ཆེན་པོ་དག་གིས་ཡོངས་སུ་གང་ངོ་།
en: some are completely filled with flowers, and some are completely filled with blue lotuses, red lotuses, night lotuses, white lotuses, fragrant water lilies, tiger claw flowers, and great tiger claw flowers.

source: འཆག་ས་དེ་དེ་དག་ན་ཤིང་དཔག་བསམ་ཡིད་དུ་འོང་བ་སྡོང་པོ་ནི་དམར་པོ། ལོ་མ་ནི་གསེར་དང་དངུལ་ལས་བྱས་པ་ལྷའི་རྒྱན་གྱིས་བརྒྱན་པ། །
en: Along these walkways there are beautiful wish-fulfilling trees that have red trunks and leaves made of silver and gold; are adorned with divine adornments;

source: ཅོད་པན་དང་རྣ་ཆ་དང་། ཕྲེང་བའི་ཆུན་པོ་རབ་ཏུ་འཕྱང་བ། སེ་མོ་དོ་དང་། སེ་མོ་དོ་ཕྱེད་པ་རབ་ཏུ་འཕྱང་བ།
en: are hung with diadems, earrings, garlands, one hundred and eight-string and sixty-four-string necklaces;

source: དཔུང་རྒྱན་རབ་ཏུ་འཕྱང་བ། གཞན་ཡང་རྒྱན་སྣ་ཚོགས་དག་རབ་ཏུ་འཕྱང་བ་ཡོད་དོ། །
en: and are perfectly hung with armlets and a variety of other adornments.

source: འཆག་ས་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ནུབ་མོ་འཆག་ཅིང་ཐེག་པ་ཆེན་པོ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་རྗེས་སུ་དྲན་པར་བྱེད། །
en: “The bodhisattvas walk each evening along these walkways while thinking about various aspects of the Mahāyāna.

source: མྱ་ངན་ལས་འདའ་བའི་སའི་རྗེས་སུ་དྲན་པར་བྱེད། འཁོར་བའི་སྡུག་བསྔལ་ཀུན་ལ་སེམས་པར་བྱེད་དོ། །བསམས་ནས་བྱམས་པ་ལ་སྒོམ་སྟེ། །
en: They think of nirvāṇa, they contemplate all the sufferings of saṃsāra, and after contemplating suffering they meditate on love.

source: སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་དེ་ལྟར་བ་སྤུའི་ཁུང་བུ་དེ་ན་དེ་འདྲ་བའི་བྱང་ཆུབ་སེམས་དཔའ་དག་ཡོད་དོ། །
en: Sarva­nīvaraṇa­viṣkambhin, such are the bodhisattvas within that pore.

source: དེ་ལས་བབས་ནས་རྡོ་རྗེའི་སྒོ་ཞེས་བྱ་བའི་བ་སྤུའི་ཁུང་བུ་དེ་ན་མིའམ་ཅི་བརྒྱ་སྟོང་ཕྲག་དུ་མ་གནས་པ།
en: Beyond that pore, there is a pore named Vajramukha. Within it live many hundreds of thousands of kiṃnaras

source: མགུལ་རྒྱན་དང་། རྣ་ཆ་དང་། ཕྲེང་བ་དང་། རྒྱན་སྣ་ཚོགས་དང་། བྱུག་པ་ཤིན་ཏུ་བཟང་བ་དག་སྣང་ངོ་། །
en: beautified by necklaces, earrings, garlands, various jewelry, and ointments.

source: དེ་དག་རྟག་ཏུ་སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་ལ་མངོན་པར་དད། །
en: “They have continuous faith in the Buddha, Dharma, and Saṅgha.

source: ཆོས་ལ་སེམས་རྩེ་གཅིག་པར་བྱེད་པ།
en: They are focused one-pointedly on the Dharma,

source: བྱམས་པ་ལ་གནས་པར་བྱེད་པ།
en: remain in loving kindness,

source: བཟོད་པ་སྒོམ་པར་བྱེད་པ།
en: meditate on patience,

source: མྱ་ངན་ལས་འདའ་བ་སེམས་པར་བྱེད་ལ།
en: contemplate nirvāṇa,

source: མི་དག་གིས་སྐྱོ་བར་བྱེད་པ་སྟེ།
en: and are saddened for humans.

source: རིགས་ཀྱི་བུ་དེ་འདྲ་བའི་མིའམ་ཅི་མངོན་པར་དགའ་བ་དག་གནས་སོ།
en: Noble son, such are the kiṃnaras that live there.

source: བ་སྤུའི་ཁུང་བུ་དེ་ཉིད་ན་རི་བརྒྱ་ཕྲག་དུ་མ་ཡོད་དེ་
en: “There are many hundreds of mountains within that pore.

source: ཁ་ཅིག་ནི་རྡོ་རྗེའིའོ།
en: Some are made of diamonds,

source: ཁ་ཅིག་ནི་དངུལ་གྱིའོ།
en: some of silver,

source: ཁ་ཅིག་ནི་གསེར་གྱིའོ། །
en: some of gold,

source: ཁ་ཅིག་ནི་ཤེལ་གྱིའོ། །
en: some of crystal,

source: ཁ་ཅིག་ནི་མེ་ཏོག་པད་མ་དམར་པོའིའོ། །
en: some of rubies,

source: ཁ་ཅིག་ནི་རིན་པོ་ཆེ་ཨིན་དྲ་ནཱི་ལའིའོ། །
en: some of sapphires,

source: ཁ་ཅིག་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་སྟེ། །
en: and some of the seven jewels.

source: རིགས་ཀྱི་བུ་བ་སྤུའི་ཁུང་བུ་དེ་ན་མཚན་མ་དེ་འདྲ་བ་དག་སྣང་ངོ་། །
en: Noble son, such are the signs seen within that pore.

source: རིགས་ཀྱི་བུ་བ་སྤུའི་ཁུང་བུ་དེ་ན་ཤིང་དཔག་བསམ་དུ་མ་དང་། བྱི་རུའི་ཤིང་དང་། ཙན་དན་གྱི་ཤིང་དང་། སྤོས་ཀྱི་ཤིང་དུ་མ་དག་དང་།
en: “Noble son, within that pore there are many wish-fulfilling trees, coral trees, sandalwood trees, and aromatic trees.

source: རྫིང་བུ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དག་དང་།
en: There are many hundreds of thousands of bathing pools.

source: ལྷའི་གཞལ་མེད་ཁང་ཤེལ་དང་དངུལ་དང་ལྡན་པ། ཤིན་ཏུ་བཟང་བ་ཡིད་དུ་འོང་བ་མཛེས་པ།
en: There are extremely beautiful and delightful divine celestial palaces of crystal and silver.

source: དེ་འདྲ་བའི་གཞལ་མེད་ཁང་དག་ཀྱང་བྱུང་སྟེ། །
en: Such are the celestial palaces that appear there.

source: གཞལ་མེད་ཁང་དེ་དག་ཏུ་མི་འམ་ཅི་རྣམས་ངལ་བསོའོ།
en: The kiṃnaras relax in those celestial palaces

source: ངལ་བསོས་ནས་ཆོས་ཀྱི་གཏམ་བྱེད་དེ།
en: Seated, they talk about the Dharma.

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གཏམ་བྱེད། །
en: They talk about the perfection of generosity,

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གཏམ་བྱེད།
en: they talk about the perfection of conduct,

source: བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གཏམ་བྱེད།
en: they talk about the perfection of patience,

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གཏམ་བྱེད།
en: they talk about the perfection of diligence,

source: བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གཏམ་བྱེད།
en: they talk about the perfection of meditation,

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་གཏམ་བྱེད་དེ།
en: and they talk about the perfection of wisdom.

source: དེ་ལྟར་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གི་གཏམ་བྱས་ནས།
en: “When they have talked about the six perfections,

source: བདག་བདག་གི་འཆག་སར་འཆག་སྟེ།
en: they each go to walk in their own walkways.

source: འཆག་ས་ཁ་ཅིག་ནི་གསེར་གྱི་རིའོ། །
en: Some of the walkways are made of gold.

source: འཆག་ས་ཁ་ཅིག་ནི་དངུལ་གྱི་རིའོ། །
en: Some of the walkways are made of silver.

source: འཆག་ས་དེ་དག་གི་ཁོ་ར་ཁོར་ཡུག་ན་དཔག་བསམ་གྱི་ཤིང་སྡོང་པོ་ནི་དམར་པོ། ལོ་མ་ནི་གསེར་དང་དངུལ་ལས་བྱས་པ།
en: All around the walkways there are wish-fulfilling trees that have red trunks and leaves made of silver and gold,

source: ལྷའི་རྒྱན་རབ་ཏུ་འཕྱང་བ།
en: and that are hung with divine ornaments;

source: ཅོད་པན་དང་། རྣ་ཆ་དང་། ཕྲེང་བའི་ཆུན་པོ་རབ་ཏུ་འཕྱང་བ།
en: hung with diadems, earrings, and garlands;

source: དཔུང་རྒྱན་རབ་ཏུ་འཕྱང་བ།
en: hung with armlets;

source: རྐང་པའི་གདུ་བུ་རབ་ཏུ་འཕྱང་བ།
en: hung with anklets;

source: སེ་མོ་དོ་དང་སེ་མོ་དོ་ཕྱེད་པ་རབ་ཏུ་འཕྱང་བ།
en: hung with one hundred and eight-string and sixty-four-string necklaces;

source: རིན་པོ་ཆེའི་སེ་མོ་དོ་རབ་ཏུ་འཕྱང་བ་དག་ཡོད་
en: and hung with strings of jewels.

source: འཆག་ས་དེ་ན་ཤིང་དཔག་བསམ་དེ་དག་ཁང་པ་བརྩེག་མ་ལྟ་བུར་འདུག་སྟེ། །
en: These wish-fulfilling trees around the walkways are like many-storied mansions.

source: འཆག་ས་དེ་ན་མིའམ་ཅི་དག་འཆག་གོ།
en: “The kiṃnaras take walks along these walkways.

source: འཆག་པའི་ཚེ་འཁོར་བ་ལ་སྐྱོ་བ་ལ་རྗེས་སུ་སེམས་ཏེ།
en: While they are walking, they contemplate with sadness the sufferings of saṃsāra:

source: ཀྱེ་མའོ་སྡུག་བསྔལ་ལོ། །ཀྱེ་མའོ་སྡུག་བསྔལ་ལོ། །འཆི་བ་སྡུག་བསྔལ་ལོ། །
en: ‘Oh, the suffering! Oh, the suffering! Death is suffering!

source: ཀྱེ་མའོ་སྡུག་བསྔལ་ལོ། །དབུལ་བ་དེ་ཡང་སྡུག་བསྔལ་ལོ།
en: Oh, the suffering! Poverty is also suffering!

source: ཀྱེ་མའོ་སྡུག་བསྔལ་ལོ། །འདོད་ཅིང་མཛའ་བ་དང་བྲལ་བ་དང་། མི་འདོད་ཅིང་མི་མཛའ་བ་དང་ཕྲད་པ་དེ་ཤིན་ཏུ་མི་བཟད་པར་སྡུག་བསྔལ་ལོ། །
en: Oh, the suffering! Separation from the desired and beloved and encountering the undesired and the disliked is extremely unendurable suffering!

source: ཐིག་ནག་པོ་གདབ་པར་སྐྱེས་པ་དང་། འོ་དོད་འབོད་པར་སྐྱེས་པ་དང་། ཧ་ཧ་ཞེས་ཟེར་བའི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོར་སྐྱེས་པ་དང་། །
en: There are those who are born in Kālasūtra, born in Raurava, born in the great hell of Hāhava,

source: མེའི་རྫ་མར་སྐྱེས་པ་དང་། རྡོ་རྗེའི་རི་ལ་སྐྱེས་པ་དང་། ཡི་དགས་ཀྱི་གྲོང་ཁྱེར་དུ་སྐྱེས་པའི་སེམས་ཅན་དེ་དག་ཤིན་ཏུ་སྡུག་བསྔལ་ལོ། །
en: born in Agnighaṭa, born in Vajraśaila, and born in the city of the pretas. Those beings have the greatest suffering.’

source: ཞེས་དེ་ལྟར་མིའམ་ཅི་དེ་དག་ལུས་ལ་སེམས་སོ། །
en: The kiṃnaras contemplate in that way,

source: བསམས་ནས་མྱ་ངན་ལས་འདའ་བའི་དབྱིངས་ལ་སེམས་ཏེ། །
en: and following that contemplation they contemplate the essence of nirvāṇa.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་མིའམ་ཅི་ཆོས་ལ་མངོན་པར་དགའ་བ་དག་རྟག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་མིང་གི་རྗེས་སུ་དྲན་པར་བྱེད་དེ།
en: “Noble son, the kiṃnaras who rejoice in the Dharma in that way continually remember the name of Bodhisattva Mahāsattva Avalokiteśvara.

source: དེའི་ཚེ་དེ་དག་ལ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱེད་དོ།
en: Remembering his name, they receive all kinds of things.

source: རིགས་ཀྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ནི་དཀོན་པའོ།
en: “Thus, noble son, it is difficult to find Bodhisattva Mahāsattva Avalokiteśvara,

source: སེམས་ཅན་རྣམས་ཀྱི་ཕ་དང་མར་གྱུར་པའོ། །
en: who is the father and mother of all beings,

source: སེམས་ཅན་ཐམས་ཅད་ལ་མི་འཇིགས་པ་སྦྱིན་པར་བྱེད་པའོ། །
en: who brings freedom from fear to all beings,

source: སེམས་ཅན་ཐམས་ཅད་ལ་ལམ་སྟོན་པར་བྱེད་པའོ། །
en: who reveals the path to all beings,

source: སེམས་ཅན་ཐམས་ཅད་ལ་དགེ་བའི་བཤེས་གཉེན་དུ་གྱུར་པ་སྟེ།
en: who is a kalyāṇamitra for all beings.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ནི་དེ་ལྟ་བུའོ། །
en: Noble son, this is what Bodhisattva Mahāsattva Avalokiteśvara is like.

source: དེའི་མིང་འཛིན་པ་ཡང་དཀོན་ཏེ།
en: “Noble son, it is difficult to obtain his name.

source: དེ་དག་དེའི་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཀྱི་མིང་གི་རྗེས་སུ་དྲན་ན་དེའི་ཚེ་བ་སྤུའི་ཁུང་བུ་དེ་དག་ཏུ་སྐྱེའོ།
en: Those who remember the name that is the six-syllable vidyāmantra will be reborn in those pores.

source: སླར་འཁོར་བར་མི་འཁོར་རོ།
en: They will no longer continue to be in saṃsāra.

source: བ་སྤུའི་ཁུང་བུ་ནས་བ་སྤུའི་ཁུང་བུར་འགྲོའོ། །
en: They will go from one pore to another,

source: བ་སྤུའི་ཁུང་བུ་དེ་དག་ན་ཡང་མྱ་ངན་ལས་འདའ་བའི་ས་ཚོལ་བའི་བར་དུ་གནས་པར་འགྱུར་རོ།
en: living within those pores until they reach the level of nirvāṇa.”

source: བཅོམ་ལྡན་འདས་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ག་ལས་བཙལ་བར་བགྱི།
en: “Bhagavat, where can the six-syllable mahāvidyā be obtained?”

source: རིགས་ཀྱི་བུ་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་ཆེན་མོ་ནི་དེ་བཞིན་གཤེགས་པས་ཡང་མི་མཁྱེན་ན་བྱང་ཆུབ་སེམས་དཔས་ལྟ་ཅི་སྨོས། །
en: “Noble son, even the tathāgatas do not know the six-syllable mahāvidyā, let alone the bodhisattvas.”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དག་གིས་ཀྱང་མི་མཁྱེན་ཏམ།
en: “Bhagavat, do the tathāgatas, arhats, and samyaksaṃbuddhas not know it?”

source: རིགས་ཀྱི་བུ་ཡི་གེ་དྲུག་པའི་རིག་སྔགས་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་སྙིང་པོ་དམ་པའོ། །
en: “Noble son, the six-syllable mahāvidyā is the supreme essence of Bodhisattva Mahāsattva Avalokiteśvara.

source: གང་དག་སྙིང་པོ་དམ་པ་ཤེས་པ་དེ་དག་ནི་ཐར་པ་ཤེས་པའོ།
en: Those who know that supreme essence know liberation.”
